app/controllers/students_controller.rb

  def update
    @student = set_student
    @student.update(student_params)
---
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2017-05-22 14:17:39.435160"], ["id", 1]]